AITT-VN/ohstem_arduino_board/ohstem_esp32-3.0.4/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.SLOW_CLK_TPYE=Slow Clk Type(only for LoRaWAN)
menu.einksize=E-Ink Display Size
menu.NetworkLogLevel=Network Log Level
##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

# Generic definition to be used for USB discovery of CDC/JTAG
esp32_family.name=OhStem Boards
esp32_family.hide=true
esp32_family.vid.0=0x303a
esp32_family.pid.0=0x1001
esp32_family.upload_port.0.vid=0x303a
esp32_family.upload_port.0.pid=0x1001
esp32_family.build.board=OhStem Boards

##############################################################

yolo_uno.name=Yolo UNO (ESP32-S3)
yolo_uno.vid.0=0x303a
yolo_uno.pid.0=0x1001

yolo_uno.bootloader.tool=esptool_py
yolo_uno.bootloader.tool.default=esptool_py

yolo_uno.upload.tool=esptool_py
yolo_uno.upload.tool.default=esptool_py
yolo_uno.upload.tool.network=esp_ota

yolo_uno.upload.maximum_size=1310720
yolo_uno.upload.maximum_data_size=327680
yolo_uno.upload.flags=
yolo_uno.upload.extra_flags=
yolo_uno.upload.use_1200bps_touch=false
yolo_uno.upload.wait_for_upload_port=false

yolo_uno.serial.disableDTR=false
yolo_uno.serial.disableRTS=false

yolo_uno.build.tarch=xtensa
yolo_uno.build.bootloader_addr=0x0
yolo_uno.build.target=esp32s3
yolo_uno.build.mcu=esp32s3
yolo_uno.build.core=esp32
yolo_uno.build.variant=yolo_uno
yolo_uno.build.board=YOLO_UNO

yolo_uno.build.usb_mode=1
yolo_uno.build.cdc_on_boot=0
yolo_uno.build.msc_on_boot=0
yolo_uno.build.dfu_on_boot=0
yolo_uno.build.f_cpu=240000000L
yolo_uno.build.flash_size=4MB
yolo_uno.build.flash_freq=80m
yolo_uno.build.flash_mode=dio
yolo_uno.build.boot=qio
yolo_uno.build.boot_freq=80m
yolo_uno.build.partitions=default
yolo_uno.build.defines=
yolo_uno.build.loop_core=
yolo_uno.build.event_core=
yolo_uno.build.psram_type=qspi
yolo_uno.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
yolo_uno.menu.JTAGAdapter.default=Disabled
yolo_uno.menu.JTAGAdapter.default.build.copy_jtag_files=0
yolo_uno.menu.JTAGAdapter.builtin=Integrated USB JTAG
yolo_uno.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
yolo_uno.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
yolo_uno.menu.JTAGAdapter.external=FTDI Adapter
yolo_uno.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
yolo_uno.menu.JTAGAdapter.external.build.copy_jtag_files=1
yolo_uno.menu.JTAGAdapter.bridge=ESP USB Bridge
yolo_uno.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
yolo_uno.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

yolo_uno.menu.PSRAM.disabled=Disabled
yolo_uno.menu.PSRAM.disabled.build.defines=
yolo_uno.menu.PSRAM.disabled.build.psram_type=qspi
yolo_uno.menu.PSRAM.enabled=QSPI PSRAM
yolo_uno.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
yolo_uno.menu.PSRAM.enabled.build.psram_type=qspi
yolo_uno.menu.PSRAM.opi=OPI PSRAM
yolo_uno.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
yolo_uno.menu.PSRAM.opi.build.psram_type=opi

yolo_uno.menu.FlashMode.qio=QIO 80MHz
yolo_uno.menu.FlashMode.qio.build.flash_mode=dio
yolo_uno.menu.FlashMode.qio.build.boot=qio
yolo_uno.menu.FlashMode.qio.build.boot_freq=80m
yolo_uno.menu.FlashMode.qio.build.flash_freq=80m
yolo_uno.menu.FlashMode.qio120=QIO 120MHz
yolo_uno.menu.FlashMode.qio120.build.flash_mode=dio
yolo_uno.menu.FlashMode.qio120.build.boot=qio
yolo_uno.menu.FlashMode.qio120.build.boot_freq=120m
yolo_uno.menu.FlashMode.qio120.build.flash_freq=80m
yolo_uno.menu.FlashMode.dio=DIO 80MHz
yolo_uno.menu.FlashMode.dio.build.flash_mode=dio
yolo_uno.menu.FlashMode.dio.build.boot=dio
yolo_uno.menu.FlashMode.dio.build.boot_freq=80m
yolo_uno.menu.FlashMode.dio.build.flash_freq=80m
yolo_uno.menu.FlashMode.opi=OPI 80MHz
yolo_uno.menu.FlashMode.opi.build.flash_mode=dout
yolo_uno.menu.FlashMode.opi.build.boot=opi
yolo_uno.menu.FlashMode.opi.build.boot_freq=80m
yolo_uno.menu.FlashMode.opi.build.flash_freq=80m

yolo_uno.menu.FlashSize.4M=4MB (32Mb)
yolo_uno.menu.FlashSize.4M.build.flash_size=4MB
yolo_uno.menu.FlashSize.8M=8MB (64Mb)
yolo_uno.menu.FlashSize.8M.build.flash_size=8MB
yolo_uno.menu.FlashSize.8M.build.partitions=default_8MB
yolo_uno.menu.FlashSize.16M=16MB (128Mb)
yolo_uno.menu.FlashSize.16M.build.flash_size=16MB
yolo_uno.menu.FlashSize.32M=32MB (256Mb)
yolo_uno.menu.FlashSize.32M.build.flash_size=32MB
yolo_uno.menu.FlashSize.32M.build.partitions=app5M_fat24M_32MB

yolo_uno.menu.LoopCore.1=Core 1
yolo_uno.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
yolo_uno.menu.LoopCore.0=Core 0
yolo_uno.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

yolo_uno.menu.EventsCore.1=Core 1
yolo_uno.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
yolo_uno.menu.EventsCore.0=Core 0
yolo_uno.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

yolo_uno.menu.USBMode.hwcdc=Hardware CDC and JTAG
yolo_uno.menu.USBMode.hwcdc.build.usb_mode=1
yolo_uno.menu.USBMode.default=USB-OTG (TinyUSB)
yolo_uno.menu.USBMode.default.build.usb_mode=0

yolo_uno.menu.CDCOnBoot.default=Disabled
yolo_uno.menu.CDCOnBoot.default.build.cdc_on_boot=0
yolo_uno.menu.CDCOnBoot.cdc=Enabled
yolo_uno.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

yolo_uno.menu.MSCOnBoot.default=Disabled
yolo_uno.menu.MSCOnBoot.default.build.msc_on_boot=0
yolo_uno.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
yolo_uno.menu.MSCOnBoot.msc.build.msc_on_boot=1

