AITT-VN/ohstem_arduino_board/ohstem_esp32-3.0.4/boards.txt
yolo_uno.menu.DFUOnBoot.default=Disabled
yolo_uno.menu.DFUOnBoot.default.build.dfu_on_boot=0
yolo_uno.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
yolo_uno.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

yolo_uno.menu.UploadMode.default=UART0 / Hardware CDC
yolo_uno.menu.UploadMode.default.upload.use_1200bps_touch=false
yolo_uno.menu.UploadMode.default.upload.wait_for_upload_port=false
yolo_uno.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
yolo_uno.menu.UploadMode.cdc.upload.use_1200bps_touch=true
yolo_uno.menu.UploadMode.cdc.upload.wait_for_upload_port=true

yolo_uno.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
yolo_uno.menu.PartitionScheme.default.build.partitions=default
yolo_uno.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
yolo_uno.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
yolo_uno.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
yolo_uno.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
yolo_uno.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
yolo_uno.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
yolo_uno.menu.PartitionScheme.minimal.build.partitions=minimal
yolo_uno.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
yolo_uno.menu.PartitionScheme.no_fs.build.partitions=no_fs
yolo_uno.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
yolo_uno.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
yolo_uno.menu.PartitionScheme.no_ota.build.partitions=no_ota
yolo_uno.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
yolo_uno.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
yolo_uno.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
yolo_uno.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
yolo_uno.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
yolo_uno.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
yolo_uno.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
yolo_uno.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
yolo_uno.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
yolo_uno.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
yolo_uno.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
yolo_uno.menu.PartitionScheme.huge_app.build.partitions=huge_app
yolo_uno.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
yolo_uno.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
yolo_uno.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
yolo_uno.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
yolo_uno.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
yolo_uno.menu.PartitionScheme.fatflash.build.partitions=ffat
yolo_uno.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
yolo_uno.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
yolo_uno.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
yolo_uno.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
yolo_uno.menu.PartitionScheme.rainmaker=RainMaker 4MB
yolo_uno.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
yolo_uno.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
yolo_uno.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
yolo_uno.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
yolo_uno.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
yolo_uno.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
yolo_uno.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
yolo_uno.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4116480
yolo_uno.menu.PartitionScheme.app5M_fat24M_32MB=32M Flash (4.8MB APP/22MB FATFS)
yolo_uno.menu.PartitionScheme.app5M_fat24M_32MB.build.partitions=large_fat_32MB
yolo_uno.menu.PartitionScheme.app5M_fat24M_32MB.upload.maximum_size=4718592
yolo_uno.menu.PartitionScheme.app5M_little24M_32MB=32M Flash (4.8MB APP/22MB LittleFS)
yolo_uno.menu.PartitionScheme.app5M_little24M_32MB.build.partitions=large_littlefs_32MB
yolo_uno.menu.PartitionScheme.app5M_little24M_32MB.upload.maximum_size=4718592
yolo_uno.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
yolo_uno.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
yolo_uno.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
yolo_uno.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
yolo_uno.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
yolo_uno.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
yolo_uno.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
yolo_uno.menu.PartitionScheme.custom=Custom
yolo_uno.menu.PartitionScheme.custom.build.partitions=
yolo_uno.menu.PartitionScheme.custom.upload.maximum_size=16777216

yolo_uno.menu.CPUFreq.240=240MHz (WiFi)
yolo_uno.menu.CPUFreq.240.build.f_cpu=240000000L
yolo_uno.menu.CPUFreq.160=160MHz (WiFi)
yolo_uno.menu.CPUFreq.160.build.f_cpu=160000000L
yolo_uno.menu.CPUFreq.80=80MHz (WiFi)
yolo_uno.menu.CPUFreq.80.build.f_cpu=80000000L
yolo_uno.menu.CPUFreq.40=40MHz
yolo_uno.menu.CPUFreq.40.build.f_cpu=40000000L
yolo_uno.menu.CPUFreq.20=20MHz
yolo_uno.menu.CPUFreq.20.build.f_cpu=20000000L
yolo_uno.menu.CPUFreq.10=10MHz
yolo_uno.menu.CPUFreq.10.build.f_cpu=10000000L

yolo_uno.menu.UploadSpeed.921600=921600
yolo_uno.menu.UploadSpeed.921600.upload.speed=921600
yolo_uno.menu.UploadSpeed.115200=115200
yolo_uno.menu.UploadSpeed.115200.upload.speed=115200
yolo_uno.menu.UploadSpeed.256000.windows=256000
yolo_uno.menu.UploadSpeed.256000.upload.speed=256000
yolo_uno.menu.UploadSpeed.230400.windows.upload.speed=256000
yolo_uno.menu.UploadSpeed.230400=230400
yolo_uno.menu.UploadSpeed.230400.upload.speed=230400
yolo_uno.menu.UploadSpeed.460800.linux=460800
yolo_uno.menu.UploadSpeed.460800.macosx=460800
yolo_uno.menu.UploadSpeed.460800.upload.speed=460800
yolo_uno.menu.UploadSpeed.512000.windows=512000
yolo_uno.menu.UploadSpeed.512000.upload.speed=512000

