AITT-VN/ohstem_arduino_board/ohstem_esp32-3.0.4/boards.txt
yolo_uno.menu.DebugLevel.none=None
yolo_uno.menu.DebugLevel.none.build.code_debug=0
yolo_uno.menu.DebugLevel.error=Error
yolo_uno.menu.DebugLevel.error.build.code_debug=1
yolo_uno.menu.DebugLevel.warn=Warn
yolo_uno.menu.DebugLevel.warn.build.code_debug=2
yolo_uno.menu.DebugLevel.info=Info
yolo_uno.menu.DebugLevel.info.build.code_debug=3
yolo_uno.menu.DebugLevel.debug=Debug
yolo_uno.menu.DebugLevel.debug.build.code_debug=4
yolo_uno.menu.DebugLevel.verbose=Verbose
yolo_uno.menu.DebugLevel.verbose.build.code_debug=5

yolo_uno.menu.EraseFlash.none=Disabled
yolo_uno.menu.EraseFlash.none.upload.erase_cmd=
yolo_uno.menu.EraseFlash.all=Enabled
yolo_uno.menu.EraseFlash.all.upload.erase_cmd=-e

yolo_uno.menu.ZigbeeMode.default=Disabled
yolo_uno.menu.ZigbeeMode.default.build.zigbee_mode=
yolo_uno.menu.ZigbeeMode.default.build.zigbee_libs=
yolo_uno.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator)
yolo_uno.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
yolo_uno.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr -lzboss_port

##############################################################

yolobit.name=YoloBit

yolobit.bootloader.tool=esptool_py
yolobit.bootloader.tool.default=esptool_py

yolobit.upload.tool=esptool_py
yolobit.upload.tool.default=esptool_py
yolobit.upload.tool.network=esp_ota

yolobit.upload.maximum_size=1310720
yolobit.upload.maximum_data_size=327680
yolobit.upload.flags=
yolobit.upload.extra_flags=

yolobit.serial.disableDTR=true
yolobit.serial.disableRTS=true

yolobit.build.tarch=xtensa
yolobit.build.bootloader_addr=0x1000
yolobit.build.target=esp32
yolobit.build.mcu=esp32
yolobit.build.core=esp32
yolobit.build.variant=yolobit
yolobit.build.board=YOLOBIT

yolobit.build.f_cpu=240000000L
yolobit.build.flash_size=4MB
yolobit.build.flash_freq=40m
yolobit.build.flash_mode=dio
yolobit.build.boot=dio
yolobit.build.partitions=default
yolobit.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
yolobit.build.extra_libs=

yolobit.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
yolobit.menu.PartitionScheme.default.build.partitions=default
yolobit.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
yolobit.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
yolobit.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
yolobit.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
yolobit.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
yolobit.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
yolobit.menu.PartitionScheme.minimal.build.partitions=minimal
yolobit.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
yolobit.menu.PartitionScheme.no_ota.build.partitions=no_ota
yolobit.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
yolobit.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
yolobit.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
yolobit.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
yolobit.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
yolobit.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
yolobit.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
yolobit.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
yolobit.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
yolobit.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
yolobit.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
yolobit.menu.PartitionScheme.huge_app.build.partitions=huge_app
yolobit.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
yolobit.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
yolobit.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
yolobit.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
yolobit.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
yolobit.menu.PartitionScheme.fatflash.build.partitions=ffat
yolobit.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
yolobit.menu.PartitionScheme.rainmaker=RainMaker 4MB
yolobit.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
yolobit.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
yolobit.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
yolobit.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
yolobit.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
yolobit.menu.PartitionScheme.custom=Custom
yolobit.menu.PartitionScheme.custom.build.partitions=
yolobit.menu.PartitionScheme.custom.upload.maximum_size=16777216

yolobit.menu.FlashMode.qio=QIO
yolobit.menu.FlashMode.qio.build.flash_mode=dio
yolobit.menu.FlashMode.qio.build.boot=qio
yolobit.menu.FlashMode.dio=DIO
yolobit.menu.FlashMode.dio.build.flash_mode=dio
yolobit.menu.FlashMode.dio.build.boot=dio

yolobit.menu.FlashFreq.80=80MHz
yolobit.menu.FlashFreq.80.build.flash_freq=80m
yolobit.menu.FlashFreq.40=40MHz
yolobit.menu.FlashFreq.40.build.flash_freq=40m

yolobit.menu.UploadSpeed.921600=921600
yolobit.menu.UploadSpeed.921600.upload.speed=921600
yolobit.menu.UploadSpeed.115200=115200
yolobit.menu.UploadSpeed.115200.upload.speed=115200
yolobit.menu.UploadSpeed.256000.windows=256000
yolobit.menu.UploadSpeed.256000.upload.speed=256000
yolobit.menu.UploadSpeed.230400.windows.upload.speed=256000
yolobit.menu.UploadSpeed.230400=230400
yolobit.menu.UploadSpeed.230400.upload.speed=230400
yolobit.menu.UploadSpeed.460800.linux=460800
yolobit.menu.UploadSpeed.460800.macosx=460800
yolobit.menu.UploadSpeed.460800.upload.speed=460800
yolobit.menu.UploadSpeed.512000.windows=512000
yolobit.menu.UploadSpeed.512000.upload.speed=512000

yolobit.menu.DebugLevel.none=None
yolobit.menu.DebugLevel.none.build.code_debug=0
yolobit.menu.DebugLevel.error=Error
yolobit.menu.DebugLevel.error.build.code_debug=1
yolobit.menu.DebugLevel.warn=Warn
yolobit.menu.DebugLevel.warn.build.code_debug=2
yolobit.menu.DebugLevel.info=Info
yolobit.menu.DebugLevel.info.build.code_debug=3
yolobit.menu.DebugLevel.debug=Debug
yolobit.menu.DebugLevel.debug.build.code_debug=4
yolobit.menu.DebugLevel.verbose=Verbose
yolobit.menu.DebugLevel.verbose.build.code_debug=5

