AITT-VN/ohstem_arduino_board/ohstem_esp32-3.0.4/boards.txt
yolobit.menu.EraseFlash.none=Disabled
yolobit.menu.EraseFlash.none.upload.erase_cmd=
yolobit.menu.EraseFlash.all=Enabled
yolobit.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

xcontroller.name=xController

xcontroller.bootloader.tool=esptool_py
xcontroller.bootloader.tool.default=esptool_py

xcontroller.upload.tool=esptool_py
xcontroller.upload.tool.default=esptool_py
xcontroller.upload.tool.network=esp_ota

xcontroller.upload.maximum_size=1310720
xcontroller.upload.maximum_data_size=327680
xcontroller.upload.flags=
xcontroller.upload.extra_flags=

xcontroller.serial.disableDTR=true
xcontroller.serial.disableRTS=true

xcontroller.build.tarch=xtensa
xcontroller.build.bootloader_addr=0x1000
xcontroller.build.target=esp32
xcontroller.build.mcu=esp32
xcontroller.build.core=esp32
xcontroller.build.variant=xcontroller
xcontroller.build.board=XCONTROLLER

xcontroller.build.f_cpu=240000000L
xcontroller.build.flash_size=4MB
xcontroller.build.flash_freq=40m
xcontroller.build.flash_mode=dio
xcontroller.build.boot=dio
xcontroller.build.partitions=default
xcontroller.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
xcontroller.build.extra_libs=

xcontroller.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
xcontroller.menu.PartitionScheme.default.build.partitions=default
xcontroller.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
xcontroller.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
xcontroller.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
xcontroller.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
xcontroller.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
xcontroller.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
xcontroller.menu.PartitionScheme.minimal.build.partitions=minimal
xcontroller.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
xcontroller.menu.PartitionScheme.no_ota.build.partitions=no_ota
xcontroller.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
xcontroller.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
xcontroller.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
xcontroller.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
xcontroller.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
xcontroller.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
xcontroller.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
xcontroller.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
xcontroller.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
xcontroller.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
xcontroller.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
xcontroller.menu.PartitionScheme.huge_app.build.partitions=huge_app
xcontroller.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
xcontroller.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
xcontroller.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
xcontroller.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
xcontroller.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
xcontroller.menu.PartitionScheme.fatflash.build.partitions=ffat
xcontroller.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
xcontroller.menu.PartitionScheme.rainmaker=RainMaker 4MB
xcontroller.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
xcontroller.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
xcontroller.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
xcontroller.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
xcontroller.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
xcontroller.menu.PartitionScheme.custom=Custom
xcontroller.menu.PartitionScheme.custom.build.partitions=
xcontroller.menu.PartitionScheme.custom.upload.maximum_size=16777216

xcontroller.menu.FlashMode.qio=QIO
xcontroller.menu.FlashMode.qio.build.flash_mode=dio
xcontroller.menu.FlashMode.qio.build.boot=qio
xcontroller.menu.FlashMode.dio=DIO
xcontroller.menu.FlashMode.dio.build.flash_mode=dio
xcontroller.menu.FlashMode.dio.build.boot=dio

xcontroller.menu.FlashFreq.80=80MHz
xcontroller.menu.FlashFreq.80.build.flash_freq=80m
xcontroller.menu.FlashFreq.40=40MHz
xcontroller.menu.FlashFreq.40.build.flash_freq=40m

xcontroller.menu.UploadSpeed.921600=921600
xcontroller.menu.UploadSpeed.921600.upload.speed=921600
xcontroller.menu.UploadSpeed.115200=115200
xcontroller.menu.UploadSpeed.115200.upload.speed=115200
xcontroller.menu.UploadSpeed.256000.windows=256000
xcontroller.menu.UploadSpeed.256000.upload.speed=256000
xcontroller.menu.UploadSpeed.230400.windows.upload.speed=256000
xcontroller.menu.UploadSpeed.230400=230400
xcontroller.menu.UploadSpeed.230400.upload.speed=230400
xcontroller.menu.UploadSpeed.460800.linux=460800
xcontroller.menu.UploadSpeed.460800.macosx=460800
xcontroller.menu.UploadSpeed.460800.upload.speed=460800
xcontroller.menu.UploadSpeed.512000.windows=512000
xcontroller.menu.UploadSpeed.512000.upload.speed=512000

xcontroller.menu.DebugLevel.none=None
xcontroller.menu.DebugLevel.none.build.code_debug=0
xcontroller.menu.DebugLevel.error=Error
xcontroller.menu.DebugLevel.error.build.code_debug=1
xcontroller.menu.DebugLevel.warn=Warn
xcontroller.menu.DebugLevel.warn.build.code_debug=2
xcontroller.menu.DebugLevel.info=Info
xcontroller.menu.DebugLevel.info.build.code_debug=3
xcontroller.menu.DebugLevel.debug=Debug
xcontroller.menu.DebugLevel.debug.build.code_debug=4
xcontroller.menu.DebugLevel.verbose=Verbose
xcontroller.menu.DebugLevel.verbose.build.code_debug=5

xcontroller.menu.EraseFlash.none=Disabled
xcontroller.menu.EraseFlash.none.upload.erase_cmd=
xcontroller.menu.EraseFlash.all=Enabled
xcontroller.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

